read_verilog micro_ucr_hash.v
hierarchy -check -top micro_ucr_hash

proc; opt; fsm; opt; memory; opt; techmap; opt;

dfflibmap -liberty ./CMOS/cmos_cells.lib

abc -liberty ./CMOS/cmos_cells.lib

clean

#show -notitle -format pdf -prefix modulo_diagramCMOS -lib ./CMOS/cmos_cells.v

write_verilog  micro_ucr_hash_synth.v
