read_verilog RAM_memory.v
hierarchy -check -top RAM_memory

proc; opt; fsm; opt; memory; opt; techmap; opt;

dfflibmap -liberty ./CMOS/cmos_cells.lib

abc -liberty ./CMOS/cmos_cells.lib

clean

show -notitle -format pdf -prefix modulo_diagramCMOS -lib ./CMOS/cmos_cells.v

write_verilog  RAM_memory_Synth.v
